{
    "displayName": "Frameworks",
    "category": "A",
    "description": "Executes assigned responsibilities in an effective and timely manner. Finds balance between what is ideal and what is optimal under present constraints.",
    "milestones": [{
        "summary": "Works effectively within established iOS, Android or Hybrid architectures, adding minor improvements and following current best practices.",
        "signals": [
            "Understands the basics of UI components and their hierarchy for at least one platform, efficiently distinguishes which UI component should be used at the right time",
            "Delivers simple features that don't require major changes in the UI and app flow",
            "Understands the basics of UI thread and avoids blocking operations",
            "Reuses existing UI components appropriately",
            "Follows project architecture and doesn't reinvent the wheel",
            "Follows projects best practices",
            "Tests code before sending pull requests and avoids breaking the CI unit tests",
            "Understands algorithms and data structure concepts"
        ],
        "examples": [
            "Creates simple new Activities on Android",
            "Adds a field to a form in the UI",
            "Changes the color of a button",
            "Knows and uses HTTP clients framemworks",
            "Replicates the like UI component in other areas of the app",
            "Follows source formatting patterns",
            "Follows project structure organization",
            "Makes HTTP requests to web services in an asynchronous way"
        ]
    },
    {
        "summary": "Designs major new features and demonstrates a nuanced understanding of mobile platform constraints and their architectures.",
        "signals": [
            "Applies and refactors to existing code patterns and architectures ",
            "Understands each platform's lifecycle and uses it efficiently ",
            "Delivers complex features that require major changes in the UI or app architecture",
            "Is aware of platform new version updates and can apply changes to projects",
            "Delivers changes that require few modifications by the reviewer",
            "Is able to monitor performance analysis and can find memory leaks",
            "Uses components that performs better than others in different contexts"
        ],
        "examples": [
            "Sends a pull request that only requires source formatting and no major change in the code or architecture",
            "Changes a project to use MVVM in replacement of MVC",
            "Applies a new library to several parts of a project",
            "Saves and restores Activities states in the right lifecycle methods",
            "Adds support for new Swift language features after a major iOS version upgrade",
            "Uses iOS Instruments to detect memory leaks",
            "Knows the different RecyclerView and ListView and their impact in the app's performance"
        ]
    },
    {
        "summary": "Builds complex, reusable architectures that bring best practices and enable engineers to work more effectively.",
        "signals": [
            "Works effectively with Reactive Programming paradigm",
            "Pioneers architecture migration strategies that reduce programmer burden",
            "Has deep knowledge of memory and thread management",
            "Creates reusable cross-project libraries",
            "Creates patterns and best practices that can be applied to several projects",
            "Creates delightful UIs, interactions, animations that blow up the designer's minds"
        ],
        "examples": [
            "Creates source formatting  and project structure conventions",
            "Uses RxJava effectively",
            "Benchmarks dependency injection frameworks and decides which one should be used by all mobile projects",
            "Creates the Mobile SDK",
            "Creates the Screens project"
        ]
    },
    {
        "summary": "Is an industry-leading expert in mobile engineering or sets strategic mobile direction for an eng team.",
        "signals": [
            "Defines long-term goals and ensures active projects are in service of them",
            "Designs and builds innovative, industry-leading UI interactions that can used by projects outside the compahy",
            "Invents new techniques to responsibly stretch limits of a mobile platform",
            "Be a committer to a large mobile platform, language or library",
            "Participates on standards definition committees ",
            "Is a technical reference to the open source community"
        ],
        "examples": [
            "Defined and drove complete migration plan to Swift or Kotlin",
            "Implemented Android recycler views before platform support existed",
            "Sends a pull request to Retrofit",
            "Is a member of Kotlin Language Committee",
            "Has many points in Stackoverflow",
            "Is the maintainer of a GitHub project that has hundreds of stars"
        ]
        }]
    }